In [3]:
import pandas as pd
import numpy as np

In [4]:
days = ['Day 1', 'Day 1', 'Day 1','Day 2','Day 2', 'Day 2']

In [5]:
meals = [1,2,3,1,2,3]

In [6]:
hier_index = list(zip(days,meals))

In [7]:
hier_index

[('Day 1', 1),
 ('Day 1', 2),
 ('Day 1', 3),
 ('Day 2', 1),
 ('Day 2', 2),
 ('Day 2', 3)]

In [8]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [9]:
hier_index

MultiIndex([('Day 1', 1),
            ('Day 1', 2),
            ('Day 1', 3),
            ('Day 2', 1),
            ('Day 2', 2),
            ('Day 2', 3)],
           )

In [10]:
hier_index.dtypes

level_0    object
level_1     int64
dtype: object

In [11]:
arr_1 = np.random.randint(500,700,size=[6,2])

In [12]:
df_9 = pd.DataFrame(arr_1,hier_index,['M','F'])

In [13]:
df_9

           M    F
Day 1 1  625  664
      2  684  629
      3  676  680
Day 2 1  676  627
      2  640  652
      3  619  669

In [14]:
df_9.loc['Day 1']

     M    F
1  625  664
2  684  629
3  676  680

In [15]:
df_9.loc['Day 1'].loc[1]

M    625
F    664
Name: 1, dtype: int32

In [16]:
df_9.loc['Day 1'].loc[1]['F']

664

In [18]:
df_9.index.names = ['Day', 'Meal']

In [19]:
df_9

              M    F
Day   Meal
Day 1 1     625  664
      2     684  629
      3     676  680
Day 2 1     676  627
      2     640  652
      3     619  669

In [20]:
df_9.xs('Day 2')

        M    F
Meal
1     676  627
2     640  652
3     619  669

In [21]:
df_9.xs(1,level='Meal')

         M    F
Day
Day 1  625  664
Day 2  676  627

In [22]:
dict_6 = {'A':['Day 1', 'Day 1', 'Day 1', 'Day 2', 'Day 2', 'Day 2'],
         'B': [1,2,3,1,2,3],
         'C': ['M', 'F', 'M', 'F', 'M', 'F'],
         'D': [1,2,3,4,5,6]}

In [23]:
df_14 = pd.DataFrame(dict_6)

In [24]:
df_14.pivot_table(values='D', index=['A','B'], columns=['C'])

C          F    M
A     B
Day 1 1  NaN  1.0
      2  2.0  NaN
      3  NaN  3.0
Day 2 1  4.0  NaN
      2  NaN  5.0
      3  6.0  NaN

### Handling Missing data

In [25]:
dict_4 = {'A': [1,2,np.nan], 'B': [4, np.nan, np.nan], 'C': [7.,8.,9.]}
df_10 = pd.DataFrame(dict_4)
print(df_10)

     A    B    C
0  1.0  4.0  7.0
1  2.0  NaN  8.0
2  NaN  NaN  9.0

In [27]:
df_10.dropna()

     A    B    C
0  1.0  4.0  7.0

In [31]:
df_10.dropna(axis=1) #column wise axis =1

     C
0  7.0
1  8.0
2  9.0

In [35]:
df_10.dropna(thresh=2)

     A    B    C
0  1.0  4.0  7.0
1  2.0  NaN  8.0

In [36]:
df_10.fillna(value=0.0)

     A    B    C
0  1.0  4.0  7.0
1  2.0  0.0  8.0
2  0.0  0.0  9.0

In [37]:
df_10['A'].fillna(value=df_10['A'].meann())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [38]:
df_10.fillna(method='ffill') # Fill with previous value

     A    B    C
0  1.0  4.0  7.0
1  2.0  4.0  8.0
2  2.0  4.0  9.0

In [39]:
df_10.fillna(method='bfill')

     A    B    C
0  1.0  4.0  7.0
1  2.0  NaN  8.0
2  NaN  NaN  9.0

### Experimenting with Data

In [41]:
cs_df = pd.read_csv('ComputerSales.csv')

In [42]:
cs_df

,Sale ID,Contact,Sex,Age,State,Product ID,Product Type,Sale Price,Profit,Lead,Month,Year
0,1,Paul Thomas,M,43,OH,M01-F0024,Desktop,479.99,143.39,Website,January,2018
1,2,Margo Simms,F,37,WV,GT13-0024,Desktop,1249.99,230.89,Flyer 4,January,2018
2,3,Sam Stine,M,26,PA,I3670,Desktop,649.99,118.64,Website,February,2018
3,4,Moe Eggert,M,35,PA,I3593,Laptop,399.99,72.09,Website,March,2018
4,5,Jessica Elk,F,55,PA,15M-ED,Laptop,699.99,98.09,Flyer 4,March,2018
5,6,Sally Struthers,F,45,PA,GT13-0024,Desktop,1249.99,230.89,Flyer 2,April,2018
6,7,Michelle Samms,F,46,OH,GA401IV,Laptop,1349.99,180.34,Email,May,2018
7,8,Mick Roberts,M,23,OH,MY2J2LL,Tablet,999.99,146.69,Website,July,2018
8,9,Ed Klondike,M,52,OH,81TC00,Laptop,649.99,122.34,Email,July,2018
9,10,Phil Jones,M,56,WV,M01-F0024,Desktop,479.99,143.39,Flyer 2,August,2018
10,11,Rick James,M,49,PA,GA401IV,Laptop,1349.99,180.34,Flyer 3,November,2018
11,12,Sue Etna,F,54,OH,GT13-0024,Desktop,1249.99,230.89,Flyer 2,November,2018
12,13,Jason Case,M,57,PA,81TC00,Laptop,649.99,122.34,Email,November,2018
13,14,Doug Johnson,M,51,PA,I3670,Desktop,649.99,118.64,Website,December,2018
14,15,Andy Sands,M,56,OH,MY2J2LL,Tablet,999.99,146.69,Flyer 1,December,2018
15,16,Kim Collins,F,49,PA,I3593,Laptop,399.99,72.09,Flyer 2,January,2019
16,17,Edna Sanders,F,46,OH,15M-ED,Laptop,699.99,98.09,Email,February,2019
17,18,Michelle Samms,F,46,NY,MY2J2LL,Tablet,999.99,146.69,Website,March,2019
18,19,Mick Roberts,M,23,PA,I3593,Laptop,399.99,72.09,Flyer 4,March,2019
19,20,Sally Struthers,F,45,NY,81TC00,Laptop,649.99,122.34,Website,April,2019
20,21,Jason Case,M,57,PA,M01-F0024,Desktop,479.99,143.39,Flyer 4,May,2019
21,22,Doug Johnson,M,51,PA,GA401IV,Laptop,1349.99,180.34,Website,August,2019
22,23,Paul Thomas,M,43,OH,81TC00,Laptop,649.99,122.34,Website,August,2019
23,24,Margo Simms,F,37,WV,Q526FA,Laptop,1049.99,143.09,Flyer 4,November,2019
24,25,Michelle Samms,F,46,NY,I3670,Desktop,649.99,118.64,Flyer 2,November,2019
25,26,Mick Roberts,M,23,PA,Q526FA,Laptop,1049.99,143.09,Email,November,2019
26,27,Ed Klondike,M,52,OH,Q526FA,Laptop,1049.99,143.09,Website,December,2019
27,28,Moe Eggert,M,35,PA,15M-ED,Laptop,699.99,98.09,Email,December,2019
28,29,Jessica Elk,F,55,PA,GA401IV,Laptop,1349.99,180.34,Flyer 2,December,2019
29,30,Phil Jones,M,56,WV,M01-F0024,Desktop,479.99,143.39,Flyer 2,January,2020
30,31,Rick James,M,49,PA,GA401IV,Laptop,1349.99,180.34,Flyer 1,January,2020
31,32,Sue Etna,F,54,OH,GT13-0024,Desktop,1249.99,230.89,Flyer 2,February,2020
32,33,Kim Collins,F,49,PA,I3593,Laptop,399.99,72.09,Flyer 2,March,2020
33,34,Edna Sanders,F,46,OH,15M-ED,Laptop,699.99,98.09,Email,March,2020
34,35,Michelle Samms,F,46,NY,MY2J2LL,Tablet,999.99,146.69,Website,April,2020
35,36,Sally Struthers,F,45,NY,81TC00,Laptop,649.99,122.34,Website,April,2020
36,37,Jason Case,M,57,PA,M01-F0024,Desktop,479.99,143.39,Flyer 4,April,2020
37,38,Doug Johnson,M,51,PA,GA401IV,Laptop,1349.99,180.34,Website,May,2020
38,39,Moe Eggert,M,35,PA,I3593,Laptop,399.99,72.09,Website,May,2020

In [43]:
cs_df.columns

Index(['Sale ID', 'Contact', 'Sex', 'Age', 'State', 'Product ID',
       'Product Type', 'Sale Price', 'Profit', 'Lead', 'Month', 'Year'],
      dtype='object')

In [44]:
cs_df[['Product ID','Profit']].head()

  Product ID  Profit
0  M01-F0024  143.39
1  GT13-0024  230.89
2      I3670  118.64
3      I3593   72.09
4     15M-ED   98.09

In [45]:
cs_df[['Product ID','Profit']].max(axis=0).head()

Product ID    Q526FA
Profit        230.89
dtype: object

In [46]:
cs_df[cs_df['State']=='WV']['State'].count()

4

In [50]:
len(cs_df[cs_df['Year']==2019].index)

14

In [53]:
cs_df['Product ID'].value_countsounts()

GA401IV      6
M01-F0024    5
I3593        5
81TC00       5
GT13-0024    4
15M-ED       4
MY2J2LL      4
I3670        3
Q526FA       3
Name: Product ID, dtype: int64

In [54]:
cs_df[cs_df['Product ID']=='M01-F0024']['Contact']

0     Paul Thomas
9      Phil Jones
20     Jason Case
29     Phil Jones
36     Jason Case
Name: Contact, dtype: object

In [55]:
cs_df[(cs_df['Lead']=='Website') & (cs_df['Profit']>150)]['Lead'].count()

2

In [56]:
cs_df['Profit'].apply(lambda cents: str(cents).split('.')[1]=='89').value_counts()

False    35
True      4
Name: Profit, dtype: int64